# Домашнє завдання:
# 1. Створіть декоратор, який підраховуватиме, скільки разів була викликана декорована функція.
# 2. Створіть декоратор, який зареєструє декоровану функцію у списку.
# 3. Припустимо, у класі визначено метод str. Створіть такий декоратор для цього методу,
# щоб отриманий рядок зберігався у текстовий файл. Ім'я файлу має збігатися з ім'ям класу, в якому визначено метод str.
# 4. Створіть декоратор із параметрами для проведення хронометражу роботи тієї чи іншої функції. Параметрами повинні
# виступати те, скільки разів потрібно запустити функцію, що декорується, і в який файл зберегти результати хронометражу.



